open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_usbhost.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP USB host adapter.  The immutable v3.1.1.9 bundle contains a
 * CherryUSB MUSB HCD, but its hub/class stack is not used here.  NuttX owns
 * root-port waiting, enumeration, and class binding; this file adapts only
 * the exported HCD pipe and URB calls.
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <errno.h>
#include <syslog.h>

#include <nuttx/clock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>
#include <nuttx/wqueue.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbhost.h>
#include <nuttx/usb/usbhost_devaddr.h>

#include <arch/chip/bk7258_usbhost.h>

/*
 * usbh_core.h is a public SDK header, but it uses generic CONFIG_USBHOST_*
 * names to lay out vendor hub structures.  Those names are also used by
 * NuttX and can have different values.  The constants below are the values
 * in the v3.1.1.9 AP bundle; NuttX's header was parsed above, and the names
 * are removed again after the vendor types have been parsed.
 */

#ifdef CONFIG_USBHOST_MAX_RHPORTS
#  undef CONFIG_USBHOST_MAX_RHPORTS
#endif
#define CONFIG_USBHOST_MAX_RHPORTS          1
#ifdef CONFIG_USBHOST_MAX_EHPORTS
#  undef CONFIG_USBHOST_MAX_EHPORTS
#endif
#define CONFIG_USBHOST_MAX_EHPORTS          4
#ifdef CONFIG_USBHOST_MAX_INTERFACES
#  undef CONFIG_USBHOST_MAX_INTERFACES
#endif
#define CONFIG_USBHOST_MAX_INTERFACES       10
#ifdef CONFIG_USBHOST_MAX_INTF_ALTSETTINGS
#  undef CONFIG_USBHOST_MAX_INTF_ALTSETTINGS
#endif
#define CONFIG_USBHOST_MAX_INTF_ALTSETTINGS 8
#ifdef CONFIG_USBHOST_MAX_ENDPOINTS
#  undef CONFIG_USBHOST_MAX_ENDPOINTS
#endif
#define CONFIG_USBHOST_MAX_ENDPOINTS        14
#ifdef CONFIG_USBHOST_DEV_NAMELEN
#  undef CONFIG_USBHOST_DEV_NAMELEN
#endif
#define CONFIG_USBHOST_DEV_NAMELEN          16

#ifdef CLASS_CONNECT
#  undef CLASS_CONNECT
#endif
#ifdef CLASS_DISCONNECT
#  undef CLASS_DISCONNECT
#endif
#include <components/usb.h>
#include <components/cherryusb/usbh_core.h>
#include <driver/int.h>

#undef CONFIG_USBHOST_MAX_RHPORTS
#undef CONFIG_USBHOST_MAX_EHPORTS
#undef CONFIG_USBHOST_MAX_INTERFACES
#undef CONFIG_USBHOST_MAX_INTF_ALTSETTINGS
#undef CONFIG_USBHOST_MAX_ENDPOINTS
#undef CONFIG_USBHOST_DEV_NAMELEN

#define BK7258_USBH_EVENT_DEPTH 4
#define BK7258_USBH_DESC_BUFSIZE 1024
#define BK7258_USBH_XFER_TIMEOUT 500
#define BK7258_USBH_PIPE_LIMIT 10
#define BK7258_USBH_MAGIC 0x42555348u

/* The v3.1.1.9 MUSB port routes its interrupt to physical CPU2 because that
 * is the SDK application's default owner.  This project's NuttX AP primary
 * is physical CPU1.  The SDK deliberately makes its low-level HCD hooks
 * weak, so keep the HCD itself immutable and override only IRQ ownership.
 */

#define BK7258_USB_AP_PRIMARY_CORE_ID  1u
#define BK7258_USB_SDK_DEFAULT_CORE_ID 2u
#define BK7258_USB_INTERRUPT_CTRL_BIT  (1u << 19)

_Static_assert(INT_SRC_USB == 19,
               "BK7258 USB IRQ routing bit must match v3.1.1.9");

extern int32_t sys_drv_core_intr_group1_disable(uint32_t core_id,
                                                uint32_t param);
extern int32_t sys_drv_core_intr_group1_enable(uint32_t core_id,
                                               uint32_t param);
extern void USBH_IRQHandler(void);

struct bk7258_usbhost_s;

struct bk7258_usbep_s
{
  uint32_t magic;
  FAR struct bk7258_usbhost_s *priv;
  usbh_pipe_t pipe;
  bool ep0;
  bool closing;
  bool sem_initialized;
  bool async_active;
  bool async_running;
  bool async_canceling;
  bool sync_active;
  usbhost_asynch_t async_callback;
  FAR void *async_arg;
  FAR struct usbh_urb *sync_urb;
  sem_t async_done;
  struct usbh_urb async_urb;
};

struct bk7258_usb_event_s
{
  uint8_t port;
  FAR void *callback;
};

struct bk7258_usbhost_s
{
  struct usbhost_driver_s drvr;
  struct usbhost_connection_s conn;
  struct usbhost_roothubport_s rhport;
  struct usbhost_devaddr_s devgen;

  /* These are the public CherryUSB types used by the immutable HCD ABI. */

  struct usbh_hub vendor_roothub;
  struct usbh_hubport vendor_hport;

  struct bk7258_usbep_s ep0;
  spinlock_t lock;
  sem_t event_sem;
  struct work_s event_work;
  struct bk7258_usb_event_s events[BK7258_USBH_EVENT_DEPTH];
  uint8_t event_head;
  uint8_t event_count;
  uint32_t event_sequence;
  uint32_t wait_sequence;
  uint8_t event_work_queued;
  uint8_t endpoint_count;
  uint8_t active_sync;
  enum bk7258_usbhost_enumeration_state_e enumeration_state;
  uint32_t connection_generation;
  int enumeration_result;
  uint16_t configuration_length;
  bool device_descriptor_valid;
  bool configuration_descriptor_valid;
  bool configuration_truncated;
  uint8_t device_descriptor[BK7258_USBHOST_DEVICE_DESC_SIZE];
  uint8_t configuration_descriptor[BK7258_USBHOST_CONFIG_DESC_MAX];
  bool initialized;
  bool event_sem_initialized;
  bool accepting_events;
  bool shutting_down;
  bool driver_initialized;
  bool usb_open;
  bool hcd_initialized;
};

static struct bk7258_usbhost_s g_bk7258_usbhost;
static mutex_t g_bk7258_usbhost_init_lock = NXMUTEX_INITIALIZER;
/* This survives teardown/init memset and is never reused after exhaustion. */
static uint32_t g_bk7258_usbhost_generation;
static volatile int g_bk7258_usb_hcd_init_status = -ENODEV;
static volatile int g_bk7258_usb_hcd_deinit_status = -ENODEV;
static volatile int g_bk7258_usb_irq_route_status = -ENODEV;

static int bk7258_usbhost_next_generation(void)
{
  if (g_bk7258_usbhost_generation == UINT32_MAX)
    {
      return -ENOSPC;
    }

  g_bk7258_usbhost_generation++;
  if (g_bk7258_usbhost_generation == 0)
    {
      g_bk7258_usbhost_generation = 1;
    }
  return 0;
}

static void bk7258_usbhost_clear_snapshot(
  FAR struct bk7258_usbhost_s *priv)
{
  priv->enumeration_state = BK7258_USBHOST_ENUMERATION_IDLE;
  priv->enumeration_result = 0;
  priv->device_descriptor_valid = false;
  priv->configuration_descriptor_valid = false;
  priv->configuration_length = 0;
  priv->configuration_truncated = false;
  memset(priv->device_descriptor, 0, sizeof(priv->device_descriptor));
  memset(priv->configuration_descriptor, 0,
         sizeof(priv->configuration_descriptor));
}

static void bk7258_usbhost_cache_descriptor(
  FAR struct bk7258_usbhost_s *priv, uint32_t generation,
  FAR const struct usb_ctrlreq_s *req, FAR const uint8_t *buffer,
  uint32_t actual_length)
{
  uint16_t requested_length;
  uint16_t total_length;
  uint8_t descriptor_type;
  irqstate_t flags;

