open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
  if (req == NULL || buffer == NULL ||
      req->type != (USB_REQ_DIR_IN | USB_REQ_TYPE_STANDARD |
                    USB_REQ_RECIPIENT_DEVICE) ||
      req->req != USB_REQ_GETDESCRIPTOR)
    {
      return;
    }

  requested_length = (uint16_t)req->len[0] |
                     ((uint16_t)req->len[1] << 8);
  if (actual_length > requested_length)
    {
      return;
    }

  descriptor_type = req->value[1];
  if ((descriptor_type == USB_DESC_TYPE_DEVICE &&
       (requested_length < USB_SIZEOF_DEVDESC ||
        actual_length < USB_SIZEOF_DEVDESC)) ||
      (descriptor_type == USB_DESC_TYPE_CONFIG &&
       (requested_length < USB_SIZEOF_CFGDESC ||
        actual_length < USB_SIZEOF_CFGDESC)))
    {
      return;
    }
  if (descriptor_type != USB_DESC_TYPE_DEVICE &&
      descriptor_type != USB_DESC_TYPE_CONFIG)
    {
      return;
    }
  if (buffer[1] != descriptor_type || buffer[0] < USB_SIZEOF_CFGDESC ||
      (descriptor_type == USB_DESC_TYPE_DEVICE &&
       buffer[0] != USB_SIZEOF_DEVDESC))
    {
      return;
    }
  total_length = descriptor_type == USB_DESC_TYPE_CONFIG ?
    (uint16_t)((uint16_t)buffer[2] | ((uint16_t)buffer[3] << 8)) :
    (uint16_t)USB_SIZEOF_DEVDESC;
  if (total_length < USB_SIZEOF_CFGDESC)
    {
      return;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->initialized || priv->shutting_down ||
      !priv->rhport.hport.connected ||
      priv->connection_generation != generation)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return;
    }

  if (descriptor_type == USB_DESC_TYPE_DEVICE)
    {
      memcpy(priv->device_descriptor, buffer, USB_SIZEOF_DEVDESC);
      priv->device_descriptor_valid = true;
    }
  else
    {
      uint32_t copied = actual_length < total_length ? actual_length : total_length;

      if (copied > BK7258_USBHOST_CONFIG_DESC_MAX)
        {
          copied = BK7258_USBHOST_CONFIG_DESC_MAX;
        }
      memcpy(priv->configuration_descriptor, buffer, copied);
      priv->configuration_descriptor_valid = true;
      priv->configuration_length = (uint16_t)copied;
      priv->configuration_truncated = copied < total_length;
    }
  spin_unlock_irqrestore(&priv->lock, flags);
}

static void bk7258_usbhost_enumeration_complete(
  FAR struct bk7258_usbhost_s *priv, uint32_t generation, int result)
{
  irqstate_t flags = spin_lock_irqsave(&priv->lock);

  if (priv->initialized && !priv->shutting_down &&
      priv->rhport.hport.connected &&
      priv->connection_generation == generation)
    {
      priv->enumeration_result = result;
      priv->enumeration_state = result == 0 ?
        BK7258_USBHOST_ENUMERATION_COMPLETE :
        BK7258_USBHOST_ENUMERATION_FAILED;
    }
  spin_unlock_irqrestore(&priv->lock, flags);
}

int bk7258_usbhost_snapshot(FAR struct bk7258_usbhost_snapshot_s *snapshot)
{
  FAR struct bk7258_usbhost_s *priv = &g_bk7258_usbhost;
  irqstate_t flags;

  if (snapshot == NULL)
    {
      return -EINVAL;
    }

  /* Initialization and teardown memset the private state while holding this
   * mutex.  Do not wait behind a UI snapshot request. */
  if (nxmutex_trylock(&g_bk7258_usbhost_init_lock) < 0)
    {
      return -EAGAIN;
    }

  flags = spin_lock_irqsave(&priv->lock);
  memset(snapshot, 0, sizeof(*snapshot));
  snapshot->initialized = priv->initialized;
  snapshot->connected = priv->rhport.hport.connected;
  snapshot->speed = priv->rhport.hport.speed;
  snapshot->connection_generation = priv->connection_generation;
  snapshot->enumeration_state = priv->enumeration_state;
  snapshot->enumeration_result = priv->enumeration_result;
  snapshot->device_descriptor_valid = priv->device_descriptor_valid;
  memcpy(snapshot->device_descriptor, priv->device_descriptor,
         sizeof(snapshot->device_descriptor));
  snapshot->configuration_descriptor_valid =
    priv->configuration_descriptor_valid;
  snapshot->configuration_length = priv->configuration_length;
  snapshot->configuration_truncated = priv->configuration_truncated;
  memcpy(snapshot->configuration_descriptor, priv->configuration_descriptor,
         sizeof(snapshot->configuration_descriptor));
  spin_unlock_irqrestore(&priv->lock, flags);
  nxmutex_unlock(&g_bk7258_usbhost_init_lock);
  return 0;
}

static inline FAR struct bk7258_usbhost_s *bk7258_priv_from_drvr(
  FAR struct usbhost_driver_s *drvr)
{
  return (FAR struct bk7258_usbhost_s *)((uintptr_t)drvr -
                                         offsetof(struct bk7258_usbhost_s,
                                                  drvr));
}

static inline FAR struct bk7258_usbhost_s *bk7258_priv_from_conn(
  FAR struct usbhost_connection_s *conn)
{
  return (FAR struct bk7258_usbhost_s *)((uintptr_t)conn -
                                         offsetof(struct bk7258_usbhost_s,
                                                  conn));
}

static int bk7258_sdk_error(int ret)
{
  if (ret == 0)
    {
      return 0;
    }

  /* The v3.1.1.9 MUSB implementation returns negated errno values.  Keep
   * those values intact; a positive, unknown vendor result is not success.
   */

  return ret < 0 ? ret : -EIO;
}

static int bk7258_bk_error(int ret)
{
  if (ret == BK_OK)
    {
      return 0;
    }
  if (ret == BK_ERR_PARAM || ret == BK_ERR_NULL_PARAM ||
      ret == BK_ERR_USB_OPERATION_NULL_POINTER)
    {
      return -EINVAL;
    }
  if (ret == BK_ERR_NO_MEM)
    {
      return -ENOMEM;
    }
  if (ret == BK_ERR_TIMEOUT)
    {
      return -ETIMEDOUT;
    }
  if (ret == BK_ERR_BUSY || ret == BK_ERR_IN_PROGRESS)
    {
      return -EBUSY;
    }
  if (ret == BK_ERR_NOT_SUPPORT)
    {
      return -ENOTSUP;
    }
  if (ret == BK_ERR_NO_DEV || ret == BK_ERR_USB_NOT_CONNECT)
    {
      return -ENODEV;
    }
  if (ret == BK_ERR_SHUT_DOWN)
    {
      return -ESHUTDOWN;
    }

  /* BK_ERR_NOT_INIT/NOT_OPEN/NOT_CLOSE and module-specific negative values
   * are SDK state failures, not Linux errno values. */

  return -EIO;
}

/*
 * Override the SDK HCD's weak board hooks.  bk_int_isr_register() binds the
 * vendor ISR to NuttX's external IRQ dispatch; the sys-driver call selects
 * which physical CPU receives that interrupt source.
 */

void usb_hc_low_level_init(void)
{
  bk_err_t error;
  int32_t ret;

