open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
  g_bk7258_usb_irq_route_status = -EAGAIN;
  error = bk_int_isr_register(INT_SRC_USB, USBH_IRQHandler, NULL);
  if (error != BK_OK)
    {
      g_bk7258_usb_irq_route_status = -EIO;
      return;
    }

  (void)sys_drv_core_intr_group1_disable(BK7258_USB_SDK_DEFAULT_CORE_ID,
                                         BK7258_USB_INTERRUPT_CTRL_BIT);
  ret = sys_drv_core_intr_group1_enable(BK7258_USB_AP_PRIMARY_CORE_ID,
                                        BK7258_USB_INTERRUPT_CTRL_BIT);
  if (ret != 0)
    {
      (void)bk_int_isr_unregister(INT_SRC_USB);
      g_bk7258_usb_irq_route_status = -EIO;
      return;
    }

  g_bk7258_usb_irq_route_status = 0;
}

void usb_hc_low_level_deinit(void)
{
  (void)sys_drv_core_intr_group1_disable(BK7258_USB_AP_PRIMARY_CORE_ID,
                                         BK7258_USB_INTERRUPT_CTRL_BIT);
  (void)bk_int_isr_unregister(INT_SRC_USB);
  g_bk7258_usb_irq_route_status = -ENODEV;
}

/*
 * bk_usb_open()/bk_usb_close() call usbh_initialize()/usbh_deinitialize()
 * internally.  The immutable CherryUSB implementations would start their
 * private hub/class task, so the board link must use --wrap for these two
 * symbols.  The wrappers intentionally expose only the HCD lifecycle needed
 * by this NuttX adapter; they do not call the vendor upper stack.
 */

int __wrap_usbh_initialize(void)
{
  int ret = bk7258_sdk_error(usb_hc_init());

  if (ret == 0 && g_bk7258_usb_irq_route_status != 0)
    {
      int route_ret = g_bk7258_usb_irq_route_status;

      (void)usb_hc_deinit();
      ret = route_ret;
    }

  g_bk7258_usb_hcd_init_status = ret;
  return ret;
}

int __wrap_usbh_deinitialize(void)
{
  int ret = bk7258_sdk_error(usb_hc_deinit());
  g_bk7258_usb_hcd_deinit_status = ret;
  return ret;
}

static inline bool bk7258_valid_speed(uint8_t speed)
{
  return speed == USB_SPEED_LOW || speed == USB_SPEED_FULL ||
         speed == USB_SPEED_HIGH;
}

static inline uint8_t bk7258_vendor_speed(uint8_t speed)
{
  return speed;
}

static inline FAR struct bk7258_usbep_s *bk7258_ep_from_handle(
  FAR struct bk7258_usbhost_s *priv, usbhost_ep_t handle)
{
  FAR struct bk7258_usbep_s *ep = (FAR struct bk7258_usbep_s *)handle;

  if (ep == NULL || ep->magic != BK7258_USBH_MAGIC || ep->priv != priv ||
      ep->pipe == NULL || ep->closing)
    {
      return NULL;
    }

  return ep;
}

static void bk7258_event_worker(FAR void *arg);

/*
 * The vendor ISR calls usbh_roothub_thread_send_queue().  libbk_usb.a also
 * contains CherryUSB's upper-layer implementation of that symbol, so the
 * board link wraps it instead of defining a second strong copy.  Only a
 * bounded pointer ring and work_queue() are used in the ISR path; the vendor
 * status callback runs in the worker context.
 */

void __wrap_usbh_roothub_thread_send_queue(uint8_t port, FAR void *callback)
{
  FAR struct bk7258_usbhost_s *priv = &g_bk7258_usbhost;
  irqstate_t flags;
  bool queue = false;

  flags = spin_lock_irqsave(&priv->lock);
  if (priv->accepting_events && !priv->shutting_down)
    {
      uint8_t index;

      if (priv->event_count < BK7258_USBH_EVENT_DEPTH)
        {
          index = (uint8_t)((priv->event_head + priv->event_count) %
                            BK7258_USBH_EVENT_DEPTH);
          priv->event_count++;
        }
      else
        {
          /* Keep the newest edge.  The worker always re-reads the root-port
           * status, so coalescing an overloaded edge queue is safe. */

          index = (uint8_t)((priv->event_head +
                             BK7258_USBH_EVENT_DEPTH - 1) %
                            BK7258_USBH_EVENT_DEPTH);
        }

      priv->events[index].port = port;
      priv->events[index].callback = callback;

      if (!priv->event_work_queued)
        {
          priv->event_work_queued = 1;
          queue = true;
        }
    }
  spin_unlock_irqrestore(&priv->lock, flags);

  if (queue)
    {
      int ret = work_queue(HPWORK, &priv->event_work,
                           bk7258_event_worker, priv, 0);
      if (ret < 0)
        {
          flags = spin_lock_irqsave(&priv->lock);
          priv->event_work_queued = 0;
          spin_unlock_irqrestore(&priv->lock, flags);
        }
    }
}

static int bk7258_read_root_status(FAR struct bk7258_usbhost_s *priv,
                                   FAR bool *connected,
                                   FAR uint8_t *speed)
{
  struct usb_setup_packet setup;
  uint8_t status_buf[4];
  uint32_t status;
  int ret;

  (void)priv;

  memset(&setup, 0, sizeof(setup));
  setup.bmRequestType = USB_REQUEST_DIR_IN | USB_REQUEST_CLASS |
                        USB_REQUEST_RECIPIENT_OTHER;
  setup.bRequest = USB_REQUEST_GET_STATUS;
  setup.wIndex = 1; /* Vendor root-hub port numbering is one-based. */
  setup.wLength = sizeof(status_buf);
  memset(status_buf, 0, sizeof(status_buf));

  ret = bk7258_sdk_error(usbh_roothub_control(&setup, status_buf));
  if (ret < 0)
    {
      return ret;
    }

  status = (uint32_t)status_buf[0] | ((uint32_t)status_buf[1] << 8) |
           ((uint32_t)status_buf[2] << 16) |
           ((uint32_t)status_buf[3] << 24);
  *connected = (status & (1u << HUB_PORT_FEATURE_CONNECTION)) != 0;
  if ((status & (1u << HUB_PORT_FEATURE_HIGHSPEED)) != 0)
    {
      *speed = USB_SPEED_HIGH;
    }
  else if ((status & (1u << HUB_PORT_FEATURE_LOWSPEED)) != 0)
    {
      *speed = USB_SPEED_LOW;
    }
  else
    {
      *speed = USB_SPEED_FULL;
    }

  return 0;
}

static void bk7258_update_connection(FAR struct bk7258_usbhost_s *priv,
                                     bool connected, uint8_t speed,
                                     bool signal)
{
  irqstate_t flags;
  bool changed;

  flags = spin_lock_irqsave(&priv->lock);
  changed = priv->rhport.hport.connected != connected;
  if (connected && priv->rhport.hport.speed != speed)
    {
      changed = true;
    }
  priv->vendor_hport.connected = connected;
  priv->vendor_hport.speed = speed;
  priv->rhport.hport.connected = connected;
  priv->rhport.hport.speed = speed;
  if (changed)
    {
      if (bk7258_usbhost_next_generation() < 0)
        {
          priv->accepting_events = false;
          priv->shutting_down = true;
          priv->enumeration_result = -ENOSPC;
          priv->enumeration_state = BK7258_USBHOST_ENUMERATION_FAILED;
          spin_unlock_irqrestore(&priv->lock, flags);
          return;
        }
      priv->connection_generation = g_bk7258_usbhost_generation;
      bk7258_usbhost_clear_snapshot(priv);
    }
  if (!connected)
    {
      priv->rhport.hport.devclass = NULL;
      priv->rhport.hport.funcaddr = 0;
      priv->vendor_hport.dev_addr = 0;
    }

  /* A vendor connect callback and the startup status sample can describe
   * the same physical edge.  Only signal an actual logical state edge so
   * NuttX cannot start enumeration twice for one connection. */

  if (signal && changed)
    {
      priv->event_sequence++;
    }
  spin_unlock_irqrestore(&priv->lock, flags);

  if (signal && changed)
    {
      nxsem_post(&priv->event_sem);
    }
}

static void bk7258_event_worker(FAR void *arg)
{
  FAR struct bk7258_usbhost_s *priv = arg;

  for (;;)
    {
      struct bk7258_usb_event_s event;
      irqstate_t flags;
      bool connected;
      uint8_t speed;
      int ret;

      flags = spin_lock_irqsave(&priv->lock);
      if (priv->event_count == 0 || !priv->accepting_events)
        {
          priv->event_work_queued = 0;
          spin_unlock_irqrestore(&priv->lock, flags);
          return;
        }

      event = priv->events[priv->event_head];
      priv->event_head = (uint8_t)((priv->event_head + 1) %
                                   BK7258_USBH_EVENT_DEPTH);
      priv->event_count--;
      spin_unlock_irqrestore(&priv->lock, flags);

      /* The immutable MUSB callback updates its private HCD state.  It is
       * intentionally invoked only on this normal work-queue thread. */

