open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
      if (event.callback != NULL)
        {
          ((void (*)(void))event.callback)();
        }

      ret = bk7258_read_root_status(priv, &connected, &speed);
      if (ret < 0)
        {
          /* A callback is still an edge notification.  Preserve the current
           * logical state and wake the waiter; the next edge can retry. */

          nxsem_post(&priv->event_sem);
        }
      else
        {
          bk7258_update_connection(priv, connected,
                                   bk7258_vendor_speed(speed), true);
        }
    }
}

static int bk7258_wait(FAR struct usbhost_connection_s *conn,
                       FAR struct usbhost_hubport_s **hport)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_conn(conn);
  irqstate_t flags;
  int ret;

  if (hport == NULL)
    {
      return -EINVAL;
    }

  for (;;)
    {
      flags = spin_lock_irqsave(&priv->lock);
      if (!priv->initialized || priv->shutting_down)
        {
          spin_unlock_irqrestore(&priv->lock, flags);
          return -ESHUTDOWN;
        }

      if (priv->wait_sequence != priv->event_sequence)
        {
          priv->wait_sequence = priv->event_sequence;
          *hport = &priv->rhport.hport;
          spin_unlock_irqrestore(&priv->lock, flags);
          return 0;
        }
      spin_unlock_irqrestore(&priv->lock, flags);

      ret = nxsem_wait_uninterruptible(&priv->event_sem);
      if (ret < 0)
        {
          return ret;
        }
    }
}

static int bk7258_ep0configure(FAR struct usbhost_driver_s *drvr,
                               usbhost_ep_t ep0, uint8_t funcaddr,
                               uint8_t speed, uint16_t maxpacketsize)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  FAR struct bk7258_usbep_s *ep;
  irqstate_t flags;
  int ret;

  ep = bk7258_ep_from_handle(priv, ep0);
  if (ep == NULL || !ep->ep0 || funcaddr > 127 ||
      !bk7258_valid_speed(speed) || maxpacketsize == 0 ||
      maxpacketsize > 64)
    {
      return -EINVAL;
    }

  ret = bk7258_sdk_error(usbh_ep0_pipe_reconfigure(ep->pipe, funcaddr,
                                                   (uint8_t)maxpacketsize,
                                                   bk7258_vendor_speed(speed)));
  if (ret < 0)
    {
      return ret;
    }

  flags = spin_lock_irqsave(&priv->lock);
  priv->vendor_hport.dev_addr = funcaddr;
  priv->vendor_hport.speed = speed;
  priv->vendor_hport.connected = true;
  priv->rhport.hport.funcaddr = funcaddr;
  priv->rhport.hport.speed = speed;
  priv->rhport.hport.connected = true;
  spin_unlock_irqrestore(&priv->lock, flags);
  return 0;
}

static int bk7258_epalloc(FAR struct usbhost_driver_s *drvr,
                          FAR const struct usbhost_epdesc_s *epdesc,
                          FAR usbhost_ep_t *handle)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  FAR struct bk7258_usbep_s *ep;
  struct usbh_endpoint_cfg cfg;
  irqstate_t flags;
  uint8_t type;
  int ret;

  if (epdesc == NULL || handle == NULL ||
      epdesc->hport != &priv->rhport.hport || epdesc->addr > 15 ||
      epdesc->mxpacketsize == 0 || epdesc->mxpacketsize > 1024 ||
      !bk7258_valid_speed(epdesc->hport->speed))
    {
      return -EINVAL;
    }

  switch (epdesc->xfrtype)
    {
      case USB_EP_ATTR_XFER_ISOC:
        type = USB_ENDPOINT_TYPE_ISOCHRONOUS;
        break;
      case USB_EP_ATTR_XFER_BULK:
        type = USB_ENDPOINT_TYPE_BULK;
        break;
      case USB_EP_ATTR_XFER_INT:
        type = USB_ENDPOINT_TYPE_INTERRUPT;
        break;
      default:
        return -ENOTSUP;
    }

  ep = kmm_zalloc(sizeof(*ep));
  if (ep == NULL)
    {
      return -ENOMEM;
    }

  ep->magic = BK7258_USBH_MAGIC;
  ep->priv = priv;
  ep->pipe = NULL;
  ep->ep0 = false;
  ep->closing = false;
  ret = nxsem_init(&ep->async_done, 0, 0);
  if (ret < 0)
    {
      kmm_free(ep);
      return ret;
    }
  ep->sem_initialized = true;

  memset(&cfg, 0, sizeof(cfg));
  cfg.hport = &priv->vendor_hport;
  cfg.ep_addr = (uint8_t)(epdesc->addr | (epdesc->in ? 0x80 : 0));
  cfg.ep_type = type;
  cfg.ep_mps = epdesc->mxpacketsize;
  cfg.ep_interval = epdesc->interval;
  cfg.mult = 0;

  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->initialized || priv->shutting_down ||
      !priv->vendor_hport.connected ||
      priv->endpoint_count >= BK7258_USBH_PIPE_LIMIT)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxsem_destroy(&ep->async_done);
      kmm_free(ep);
      return -ENODEV;
    }
  priv->endpoint_count++;
  spin_unlock_irqrestore(&priv->lock, flags);

  ret = bk7258_sdk_error(usbh_pipe_alloc(&ep->pipe, &cfg));
  if (ret < 0 || ep->pipe == NULL)
    {
      if (ret == 0)
        {
          ret = -ENOMEM;
        }
      if (ep->pipe != NULL)
        {
          (void)usbh_pipe_free(ep->pipe);
        }
      nxsem_destroy(&ep->async_done);
      kmm_free(ep);
      flags = spin_lock_irqsave(&priv->lock);
      priv->endpoint_count--;
      spin_unlock_irqrestore(&priv->lock, flags);
      return ret;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (priv->shutting_down)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      usbh_pipe_free(ep->pipe);
      nxsem_destroy(&ep->async_done);
      kmm_free(ep);
      flags = spin_lock_irqsave(&priv->lock);
      priv->endpoint_count--;
      spin_unlock_irqrestore(&priv->lock, flags);
      return -ESHUTDOWN;
    }
  spin_unlock_irqrestore(&priv->lock, flags);
  *handle = ep;
  return 0;
}

static void bk7258_async_complete(FAR void *arg, int nbytes)
{
  FAR struct bk7258_usbep_s *ep = arg;
  usbhost_asynch_t callback;
  FAR void *callback_arg;
  irqstate_t flags;

  flags = spin_lock_irqsave(&ep->priv->lock);
  if (!ep->async_active || ep->closing || ep->async_canceling)
    {
      spin_unlock_irqrestore(&ep->priv->lock, flags);
      return;
    }

  ep->async_active = false;
  ep->async_running = true;
  callback = ep->async_callback;
  callback_arg = ep->async_arg;
  ep->async_callback = NULL;
  spin_unlock_irqrestore(&ep->priv->lock, flags);

  if (callback != NULL)
    {
      callback(callback_arg, nbytes < 0 ? nbytes : (ssize_t)nbytes);
    }

  flags = spin_lock_irqsave(&ep->priv->lock);
  ep->async_running = false;
  spin_unlock_irqrestore(&ep->priv->lock, flags);
  nxsem_post(&ep->async_done);
}

static int bk7258_cancel_ep(FAR struct bk7258_usbep_s *ep, bool closing)
{
  FAR struct bk7258_usbhost_s *priv = ep->priv;
  FAR struct usbh_urb *urb = NULL;
  usbhost_asynch_t callback = NULL;
  FAR void *callback_arg = NULL;
  FAR struct usbh_urb *sync_urb = NULL;
  bool running;
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  if (closing)
    {
      ep->closing = true;
    }
  running = ep->async_running || ep->sync_active;
  sync_urb = ep->sync_urb;
  if (ep->async_active)
    {
      ep->async_active = false;
      ep->async_canceling = true;
      urb = &ep->async_urb;
      callback = ep->async_callback;
      callback_arg = ep->async_arg;
      ep->async_callback = NULL;
    }
  spin_unlock_irqrestore(&priv->lock, flags);

