open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
  if (urb != NULL)
    {
      /* SDK kill does not invoke asynchronous completion callbacks. */

      (void)bk7258_sdk_error(usbh_kill_urb(urb));
    }

  if (sync_urb != NULL)
    {
      (void)bk7258_sdk_error(usbh_kill_urb(sync_urb));
    }

  if (callback != NULL)
    {
      callback(callback_arg, -ESHUTDOWN);
    }

  if (running)
    {
      (void)nxsem_wait_uninterruptible(&ep->async_done);
    }

  flags = spin_lock_irqsave(&priv->lock);
  ep->async_canceling = false;
  spin_unlock_irqrestore(&priv->lock, flags);
  return 0;
}

static int bk7258_epfree(FAR struct usbhost_driver_s *drvr, usbhost_ep_t handle)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  FAR struct bk7258_usbep_s *ep = bk7258_ep_from_handle(priv, handle);
  irqstate_t flags;
  int ret;

  if (ep == NULL || ep->ep0)
    {
      return -EINVAL;
    }

  ret = bk7258_cancel_ep(ep, true);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_sdk_error(usbh_pipe_free(ep->pipe));
  if (ret < 0)
    {
      flags = spin_lock_irqsave(&priv->lock);
      ep->closing = false;
      spin_unlock_irqrestore(&priv->lock, flags);
      return ret;
    }

  flags = spin_lock_irqsave(&priv->lock);
  ep->magic = 0;
  if (priv->endpoint_count > 0)
    {
      priv->endpoint_count--;
    }
  spin_unlock_irqrestore(&priv->lock, flags);
  nxsem_destroy(&ep->async_done);
  kmm_free(ep);
  return 0;
}

static int bk7258_alloc(FAR struct usbhost_driver_s *drvr,
                        FAR uint8_t **buffer, FAR size_t *maxlen)
{
  FAR uint8_t *ptr;

  (void)drvr;
  if (buffer == NULL || maxlen == NULL)
    {
      return -EINVAL;
    }

  ptr = kmm_malloc(BK7258_USBH_DESC_BUFSIZE);
  if (ptr == NULL)
    {
      return -ENOMEM;
    }
  *buffer = ptr;
  *maxlen = BK7258_USBH_DESC_BUFSIZE;
  return 0;
}

static int bk7258_free(FAR struct usbhost_driver_s *drvr, FAR uint8_t *buffer)
{
  (void)drvr;
  if (buffer == NULL)
    {
      return -EINVAL;
    }
  kmm_free(buffer);
  return 0;
}

static int bk7258_ioalloc(FAR struct usbhost_driver_s *drvr,
                          FAR uint8_t **buffer, size_t buflen)
{
  (void)drvr;
  if (buffer == NULL || buflen == 0)
    {
      return -EINVAL;
    }
  *buffer = kmm_malloc(buflen);
  return *buffer == NULL ? -ENOMEM : 0;
}

static int bk7258_iofree(FAR struct usbhost_driver_s *drvr,
                         FAR uint8_t *buffer)
{
  return bk7258_free(drvr, buffer);
}

static int bk7258_setup_urb(FAR struct bk7258_usbhost_s *priv,
                            FAR struct bk7258_usbep_s *ep,
                            FAR const struct usb_ctrlreq_s *req,
                            FAR uint8_t *buffer, bool out)
{
  struct usb_setup_packet setup;
  struct usbh_urb urb;
  irqstate_t flags;
  uint32_t generation;
  int ret;

  if (req == NULL || ep == NULL || !ep->ep0 ||
      (out && req->type & USB_REQ_DIR_MASK) != 0 ||
      (!out && (req->type & USB_REQ_DIR_MASK) == 0))
    {
      return -EINVAL;
    }

  memset(&setup, 0, sizeof(setup));
  setup.bmRequestType = req->type;
  setup.bRequest = req->req;
  setup.wValue = (uint16_t)req->value[0] | ((uint16_t)req->value[1] << 8);
  setup.wIndex = (uint16_t)req->index[0] | ((uint16_t)req->index[1] << 8);
  setup.wLength = (uint16_t)req->len[0] | ((uint16_t)req->len[1] << 8);
  memset(&urb, 0, sizeof(urb));
  urb.pipe = ep->pipe;
  urb.setup = &setup;
  urb.transfer_buffer = buffer;
  urb.transfer_buffer_length = setup.wLength;
  urb.timeout = BK7258_USBH_XFER_TIMEOUT;

  (void)nxsem_reset(&ep->async_done, 0);
  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->initialized || priv->shutting_down ||
      !priv->vendor_hport.connected)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -ENODEV;
    }
  if (ep->sync_active || ep->async_active || ep->async_running ||
      ep->async_canceling)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -EBUSY;
    }
  priv->active_sync++;
  ep->sync_active = true;
  ep->sync_urb = &urb;
  generation = priv->connection_generation;
  spin_unlock_irqrestore(&priv->lock, flags);

  ret = bk7258_sdk_error(usbh_submit_urb(&urb));

  if (ret == 0)
    {
      bk7258_usbhost_cache_descriptor(priv, generation, req, buffer,
                                      urb.actual_length);
    }

  flags = spin_lock_irqsave(&priv->lock);
  ep->sync_active = false;
  ep->sync_urb = NULL;
  priv->active_sync--;
  spin_unlock_irqrestore(&priv->lock, flags);
  nxsem_post(&ep->async_done);
  return ret;
}

static int bk7258_ctrlin(FAR struct usbhost_driver_s *drvr,
                         usbhost_ep_t handle,
                         FAR const struct usb_ctrlreq_s *req,
                         FAR uint8_t *buffer)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  return bk7258_setup_urb(priv, bk7258_ep_from_handle(priv, handle), req,
                          buffer, false);
}

static int bk7258_ctrlout(FAR struct usbhost_driver_s *drvr,
                          usbhost_ep_t handle,
                          FAR const struct usb_ctrlreq_s *req,
                          FAR const uint8_t *buffer)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  return bk7258_setup_urb(priv, bk7258_ep_from_handle(priv, handle), req,
                          (FAR uint8_t *)buffer, true);
}

static ssize_t bk7258_transfer(FAR struct usbhost_driver_s *drvr,
                               usbhost_ep_t handle, FAR uint8_t *buffer,
                               size_t buflen)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  FAR struct bk7258_usbep_s *ep = bk7258_ep_from_handle(priv, handle);
  struct usbh_urb urb;
  irqstate_t flags;
  int ret;

  if (ep == NULL || ep->ep0 || buffer == NULL || buflen == 0)
    {
      return -EINVAL;
    }

  memset(&urb, 0, sizeof(urb));
  urb.pipe = ep->pipe;
  urb.transfer_buffer = buffer;
  urb.transfer_buffer_length = buflen;
  urb.timeout = BK7258_USBH_XFER_TIMEOUT;

  (void)nxsem_reset(&ep->async_done, 0);
  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->initialized || priv->shutting_down ||
      !priv->vendor_hport.connected)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -ENODEV;
    }
  if (ep->sync_active || ep->async_active || ep->async_running ||
      ep->async_canceling)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -EBUSY;
    }
  priv->active_sync++;
  ep->sync_active = true;
  ep->sync_urb = &urb;
  spin_unlock_irqrestore(&priv->lock, flags);

  ret = bk7258_sdk_error(usbh_submit_urb(&urb));
  flags = spin_lock_irqsave(&priv->lock);
  ep->sync_active = false;
  ep->sync_urb = NULL;
  priv->active_sync--;
  spin_unlock_irqrestore(&priv->lock, flags);
  nxsem_post(&ep->async_done);
  return ret < 0 ? ret : (ssize_t)urb.actual_length;
}

