open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
#ifdef CONFIG_USBHOST_ASYNCH
static int bk7258_asynch(FAR struct usbhost_driver_s *drvr,
                         usbhost_ep_t handle, FAR uint8_t *buffer,
                         size_t buflen, usbhost_asynch_t callback,
                         FAR void *arg)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  FAR struct bk7258_usbep_s *ep = bk7258_ep_from_handle(priv, handle);
  irqstate_t flags;
  int ret;

  if (ep == NULL || ep->ep0 || buffer == NULL || buflen == 0 ||
      callback == NULL)
    {
      return -EINVAL;
    }

  (void)nxsem_reset(&ep->async_done, 0);
  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->vendor_hport.connected || priv->shutting_down ||
      ep->sync_active || ep->async_active || ep->async_running ||
      ep->async_canceling)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -EBUSY;
    }
  memset(&ep->async_urb, 0, sizeof(ep->async_urb));
  ep->async_urb.pipe = ep->pipe;
  ep->async_urb.transfer_buffer = buffer;
  ep->async_urb.transfer_buffer_length = buflen;
  ep->async_urb.complete = bk7258_async_complete;
  ep->async_urb.arg = ep;
  ep->async_callback = callback;
  ep->async_arg = arg;
  ep->async_active = true;
  spin_unlock_irqrestore(&priv->lock, flags);

  ret = bk7258_sdk_error(usbh_submit_urb(&ep->async_urb));
  if (ret < 0)
    {
      flags = spin_lock_irqsave(&priv->lock);
      ep->async_active = false;
      ep->async_callback = NULL;
      ep->async_arg = NULL;
      spin_unlock_irqrestore(&priv->lock, flags);
    }
  return ret;
}
#endif

static int bk7258_cancel(FAR struct usbhost_driver_s *drvr,
                         usbhost_ep_t handle)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);
  FAR struct bk7258_usbep_s *ep = bk7258_ep_from_handle(priv, handle);

  if (ep == NULL)
    {
      return -EINVAL;
    }

  return bk7258_cancel_ep(ep, false);
}

#ifdef CONFIG_USBHOST_HUB
static int bk7258_connect(FAR struct usbhost_driver_s *drvr,
                          FAR struct usbhost_hubport_s *hport,
                          bool connected)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);

  /* The immutable AP HCD exposes one root port only.  NuttX hub class
   * enumeration cannot be backed by the vendor hub's private structures. */

  if (hport != &priv->rhport.hport)
    {
      return -ENOTSUP;
    }
  bk7258_update_connection(priv, connected, priv->rhport.hport.speed, true);
  return 0;
}
#endif

static void bk7258_disconnect(FAR struct usbhost_driver_s *drvr,
                              FAR struct usbhost_hubport_s *hport)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_drvr(drvr);

  if (hport == &priv->rhport.hport)
    {
      bk7258_update_connection(priv, false, USB_SPEED_FULL, true);
    }
}

static int bk7258_enumerate(FAR struct usbhost_connection_s *conn,
                            FAR struct usbhost_hubport_s *hport)
{
  FAR struct bk7258_usbhost_s *priv = bk7258_priv_from_conn(conn);
  struct usb_setup_packet setup;
  irqstate_t flags;
  bool connected;
  uint8_t speed;
  uint32_t generation;
  int ret;

  if (hport != &priv->rhport.hport)
    {
      return -EINVAL;
    }

  flags = spin_lock_irqsave(&priv->lock);
  generation = priv->connection_generation;
  spin_unlock_irqrestore(&priv->lock, flags);

  ret = bk7258_read_root_status(priv, &connected, &speed);
  if (ret < 0 || !connected)
    {
      if (ret < 0) bk7258_usbhost_enumeration_complete(priv, generation, ret);
      return ret < 0 ? ret : -ENODEV;
    }

  /* The SDK root-hub SET_FEATURE RESET path performs the MUSB reset and its
   * documented 20 ms settle delays.  Keep the standard pre/post reset delay
   * here, in the caller's enumeration thread, not in the ISR worker. */

  nxsig_usleep(50 * 1000);
  memset(&setup, 0, sizeof(setup));
  setup.bmRequestType = USB_REQUEST_DIR_OUT | USB_REQUEST_CLASS |
                        USB_REQUEST_RECIPIENT_OTHER;
  setup.bRequest = USB_REQUEST_SET_FEATURE;
  setup.wValue = HUB_PORT_FEATURE_RESET;
  setup.wIndex = 1;
  ret = bk7258_sdk_error(usbh_roothub_control(&setup, NULL));
  if (ret < 0)
    {
      bk7258_usbhost_enumeration_complete(priv, generation, ret);
      return ret;
    }
  nxsig_usleep(50 * 1000);

  ret = bk7258_read_root_status(priv, &connected, &speed);
  if (ret < 0 || !connected)
    {
      if (ret < 0) bk7258_usbhost_enumeration_complete(priv, generation, ret);
      return ret < 0 ? ret : -ENODEV;
    }
  bk7258_update_connection(priv, true, speed, false);

  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->initialized || priv->shutting_down ||
      !priv->rhport.hport.connected)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -ENODEV;
    }
  generation = priv->connection_generation;
  priv->enumeration_state = BK7258_USBHOST_ENUMERATION_RUNNING;
  priv->enumeration_result = 0;
  spin_unlock_irqrestore(&priv->lock, flags);

  ret = usbhost_enumerate(hport, &hport->devclass);
  bk7258_usbhost_enumeration_complete(priv, generation, ret);
  return ret;
}

static void bk7258_initialize_driver(FAR struct bk7258_usbhost_s *priv)
{
  memset(&priv->drvr, 0, sizeof(priv->drvr));
  priv->drvr.ep0configure = bk7258_ep0configure;
  priv->drvr.epalloc = bk7258_epalloc;
  priv->drvr.epfree = bk7258_epfree;
  priv->drvr.alloc = bk7258_alloc;
  priv->drvr.free = bk7258_free;
  priv->drvr.ioalloc = bk7258_ioalloc;
  priv->drvr.iofree = bk7258_iofree;
  priv->drvr.ctrlin = bk7258_ctrlin;
  priv->drvr.ctrlout = bk7258_ctrlout;
  priv->drvr.transfer = bk7258_transfer;
#ifdef CONFIG_USBHOST_ASYNCH
  priv->drvr.asynch = bk7258_asynch;
#endif
  priv->drvr.cancel = bk7258_cancel;
#ifdef CONFIG_USBHOST_HUB
  priv->drvr.connect = bk7258_connect;
#endif
  priv->drvr.disconnect = bk7258_disconnect;

  priv->conn.wait = bk7258_wait;
  priv->conn.enumerate = bk7258_enumerate;
}

static bool bk7258_usbhost_has_ownership(
  FAR const struct bk7258_usbhost_s *priv)
{
  return priv->event_sem_initialized || priv->ep0.sem_initialized ||
         priv->ep0.pipe != NULL || priv->driver_initialized ||
         priv->usb_open || priv->hcd_initialized;
}

/* Tear down only the stages that are still owned.  A failure leaves those
 * ownership bits intact so another uninitialize call can resume at the
 * failed stage.  This function is called with the init mutex held.
 */

