open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
static int bk7258_usbhost_teardown_locked(
  FAR struct bk7258_usbhost_s *priv)
{
  bool was_initialized;
  irqstate_t flags;
  int first_error = OK;
  int ret;

  flags = spin_lock_irqsave(&priv->lock);
  was_initialized = priv->initialized;
  if (was_initialized &&
      (priv->endpoint_count != 1 || priv->active_sync != 0))
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -EBUSY;
    }

  priv->accepting_events = false;
  priv->shutting_down = true;
  priv->initialized = false;
  spin_unlock_irqrestore(&priv->lock, flags);

  if (priv->event_sem_initialized)
    {
      (void)nxsem_post(&priv->event_sem);
    }

  (void)work_cancel_sync(HPWORK, &priv->event_work);

  if (priv->ep0.pipe != NULL)
    {
      ret = bk7258_sdk_error(usbh_pipe_free(priv->ep0.pipe));
      if (ret < 0)
        {
          /* No irreversible stage has run yet for a live host, so it can
           * safely resume accepting events.  A partially initialized host
           * stays quiesced and retains ownership for a later retry.
           */

          if (was_initialized)
            {
              flags = spin_lock_irqsave(&priv->lock);
              priv->initialized = true;
              priv->shutting_down = false;
              priv->accepting_events = true;
              spin_unlock_irqrestore(&priv->lock, flags);
            }

          return ret;
        }

      priv->ep0.pipe = NULL;
      priv->vendor_hport.ep0 = NULL;
      priv->rhport.hport.ep0 = NULL;
      priv->endpoint_count = 0;
    }

  if (priv->ep0.sem_initialized)
    {
      ret = nxsem_destroy(&priv->ep0.async_done);
      if (ret < 0)
        {
          return ret;
        }

      priv->ep0.sem_initialized = false;
    }

  if (priv->usb_open)
    {
      g_bk7258_usb_hcd_deinit_status = -EAGAIN;
      ret = bk7258_bk_error(bk_usb_close());

      /* The SDK clears s_usb_open_close_flag even when its nested HCD
       * deinit reports an error.  Record the two ownership stages
       * separately so HCD cleanup can be retried directly below.
       */

      priv->usb_open = false;
      if (g_bk7258_usb_hcd_deinit_status == OK)
        {
          priv->hcd_initialized = false;
        }

      if (ret < 0)
        {
          first_error = ret;
        }
    }

  if (priv->hcd_initialized)
    {
      ret = __wrap_usbh_deinitialize();
      if (ret < 0)
        {
          return first_error < 0 ? first_error : ret;
        }

      priv->hcd_initialized = false;
    }

  if (priv->driver_initialized)
    {
      ret = bk7258_bk_error(bk_usb_driver_deinit());
      if (ret < 0)
        {
          return first_error < 0 ? first_error : ret;
        }

      priv->driver_initialized = false;
    }

  if (priv->event_sem_initialized)
    {
      ret = nxsem_destroy(&priv->event_sem);
      if (ret < 0)
        {
          return first_error < 0 ? first_error : ret;
        }

      priv->event_sem_initialized = false;
    }

  memset(priv, 0, sizeof(*priv));
  return first_error;
}

FAR struct usbhost_connection_s *bk7258_usbhost_initialize(void)
{
  FAR struct bk7258_usbhost_s *priv = &g_bk7258_usbhost;
  struct usbh_endpoint_cfg cfg;
  irqstate_t flags;
  int ret;
  int open_ret;

  ret = nxmutex_lock(&g_bk7258_usbhost_init_lock);
  if (ret < 0)
    {
      return NULL;
    }
  if (priv->initialized)
    {
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return &priv->conn;
    }
  if (g_bk7258_usbhost_generation == UINT32_MAX)
    {
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }

  if (bk7258_usbhost_has_ownership(priv) || priv->shutting_down)
    {
      /* A previous teardown stopped at a failed vendor stage.  Require the
       * caller to retry uninitialize instead of overwriting live ownership.
       */

      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }

  memset(priv, 0, sizeof(*priv));
  bk7258_initialize_driver(priv);

  priv->rhport.hport.drvr = &priv->drvr;
#ifdef CONFIG_USBHOST_HUB
  priv->rhport.hport.parent = NULL;
#endif
  priv->rhport.hport.devclass = NULL;
  priv->rhport.hport.connected = false;
  priv->rhport.hport.port = 0;
  priv->rhport.hport.funcaddr = 0;
  priv->rhport.hport.speed = USB_SPEED_FULL;
  ret = usbhost_devaddr_initialize(&priv->devgen);
  if (ret < 0)
    {
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }
  priv->rhport.pdevgen = &priv->devgen;

  memset(&priv->vendor_roothub, 0, sizeof(priv->vendor_roothub));
  priv->vendor_roothub.is_roothub = true;
  memset(&priv->vendor_hport, 0, sizeof(priv->vendor_hport));
  priv->vendor_hport.connected = false;
  priv->vendor_hport.port = 1;
  priv->vendor_hport.dev_addr = 0;
  priv->vendor_hport.speed = USB_SPEED_FULL;
  priv->vendor_hport.parent = &priv->vendor_roothub;

  ret = nxsem_init(&priv->event_sem, 0, 0);
  if (ret < 0)
    {
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }

  priv->event_sem_initialized = true;

  priv->accepting_events = true;
  g_bk7258_usb_hcd_init_status = -EAGAIN;
  g_bk7258_usb_hcd_deinit_status = -EAGAIN;
  /* bk_usb_open() performs the AP PM vote, USB clock/analog-PHY setup and
   * host custom-register programming.  Its internal usbh_initialize() call
   * reaches __wrap_usbh_initialize() at link time, so no CherryUSB hub task
   * is started here. */
  ret = bk7258_bk_error(bk_usb_driver_init());
  if (ret < 0)
    {
      (void)bk7258_usbhost_teardown_locked(priv);
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }
  priv->driver_initialized = true;

  open_ret = bk7258_bk_error(bk_usb_open(USB_HOST_MODE));
  if (open_ret == OK)
    {
      priv->usb_open = true;
    }

  if (g_bk7258_usb_hcd_init_status == OK)
    {
      priv->hcd_initialized = true;
    }

  ret = open_ret;
  if (open_ret < 0 || g_bk7258_usb_hcd_init_status != 0)
    {
      if (ret == 0)
        {
          ret = g_bk7258_usb_hcd_init_status;
        }
      (void)bk7258_usbhost_teardown_locked(priv);
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }

