open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbhost.c
  memset(&priv->ep0, 0, sizeof(priv->ep0));
  priv->ep0.magic = BK7258_USBH_MAGIC;
  priv->ep0.priv = priv;
  priv->ep0.ep0 = true;
  memset(&cfg, 0, sizeof(cfg));
  cfg.hport = &priv->vendor_hport;
  cfg.ep_addr = USB_CONTROL_OUT_EP0;
  cfg.ep_type = USB_ENDPOINT_TYPE_CONTROL;
  cfg.ep_mps = 8;
  cfg.ep_interval = 0;
  cfg.mult = 0;
  ret = nxsem_init(&priv->ep0.async_done, 0, 0);
  if (ret < 0)
    {
      (void)bk7258_usbhost_teardown_locked(priv);
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }
  priv->ep0.sem_initialized = true;

  ret = bk7258_sdk_error(usbh_pipe_alloc(&priv->ep0.pipe, &cfg));
  if (ret < 0 || priv->ep0.pipe == NULL)
    {
      if (ret == 0)
        {
          ret = -ENOMEM;
        }
      (void)bk7258_usbhost_teardown_locked(priv);
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return NULL;
    }

  priv->vendor_hport.ep0 = priv->ep0.pipe;
  priv->rhport.hport.ep0 = &priv->ep0;
  priv->endpoint_count = 1;
  flags = spin_lock_irqsave(&priv->lock);
  priv->initialized = true;
  spin_unlock_irqrestore(&priv->lock, flags);

  /* Sample the root port after the HCD and EP0 are ready.  A device may
   * have been inserted before firmware reached this point, so relying only
   * on a connect edge would leave NuttX waiting forever.  update_connection
   * suppresses a duplicate signal if the event worker wins this race. */

  {
    bool connected = false;
    uint8_t speed;

    ret = bk7258_read_root_status(priv, &connected, &speed);
    syslog(LOG_INFO,
           "BK7258 USB host: ready irq=CPU1 initial=%s status=%d\n",
           connected ? "connected" : "disconnected", ret);
    if (ret == 0 && connected)
      {
        bk7258_update_connection(priv, true, bk7258_vendor_speed(speed),
                                 true);
      }
  }

  nxmutex_unlock(&g_bk7258_usbhost_init_lock);
  return &priv->conn;
}

int bk7258_usbhost_uninitialize(void)
{
  FAR struct bk7258_usbhost_s *priv = &g_bk7258_usbhost;
  int ret;

  ret = nxmutex_lock(&g_bk7258_usbhost_init_lock);
  if (ret < 0)
    {
      return ret;
    }
  if (!priv->initialized && !bk7258_usbhost_has_ownership(priv) &&
      !priv->shutting_down)
    {
      nxmutex_unlock(&g_bk7258_usbhost_init_lock);
      return 0;
    }
  ret = bk7258_usbhost_teardown_locked(priv);
  nxmutex_unlock(&g_bk7258_usbhost_init_lock);
  return ret;
}
